{
  "homepage": "https://www.curseforge.com/minecraft/mc-mods/dynamictrees",
  "1.16.5": {
    "1.16.5-0.10.0-Beta21": "Bug Fixes:\n- Fixed secondary leaves chance property not being registered to bush gen feature.",
    "1.16.5-0.10.0-Beta20": "Bug Fixes:\n- Fixed crash whilst generating bush gen features.\n- Fixed silk touch not dropping leaves.\n- Fixed absent wart block drops.\n\nTree Pack Changes:\n- Weighted drop type now uses WeightedList.\n- Added `secondary_leaves_chance` property to bush gen feature.",
    "1.16.5-0.10.0-Beta19": "Bug Fixes:\n- Fixed crash with DT Traverse due to bush gen features not having a default property value.\n\nTree Pack Changes:\n- Added `can_craft_sapling_to_seed` and `can_craft_seed_to_sapling` properties to Species for individual control over automatically generated recipes.",
    "1.16.5-0.10.0-Beta18": "New Features:\n- Soil blocks are now defined through Tree Packs.\n- Drop creators are now defined through Tree Packs, allowing customization of tree drops.\n- Updated Patchouli manual to 2nd edition.\n\nBug Fixes:\n- Fixed threading issue due to some modded dimensions being generated on alternate threads.\n- Various minor bug fixes.",
    "1.16.5-0.10.0-Beta17": "New Features:\n- Tree branches can now be waterlogged.\n- Surface roots can now be waterlogged.\n- Added Block and Item tag generators for addons.\n\nTree Pack Changes:\n- Added `fire_proof` property to families.\n- Added `max_signal_depth` property to families.\n- Added `can_grow_on_ground` property to leaves_properties.\n- Added `sapling_name` property to species.\n- Added `seed_name` property to species.",
    "1.16.5-0.10.0-Beta16": "Bug Fixes:\n- Fixed tree pack loading order.",
    "1.16.5-0.10.0-Beta15": "Enhancements:\n+ The burgeoning potion now fills fertility when used and persists until fertility depletes instead of running on a timer.\n+ Bone meal now restores two points of fertility on application.\n+ Added many new custom tags and better integration with vanilla tags. Details can be found here: https://github.com/ferreusveritas/DynamicTrees/wiki/Tags.\nChanges:\n- Disabled persistence and fertility potions, will be removed entirely in the next version.\n- Beehives are now slightly rarer in forests.\nTechnical Changes:\n- Certain species location overrides will now require a separate sapling block to function (to fix crash with Minecolonies).\n- Json biome selectors can now filter biomes by their category.\n- Json block property appliers can edit the light block property to make blocks like leaves emit light.\n- Branch model loaders now automatically default to a thick branch model if the family's maximum branch radius is greater than 8.\n- Added Palm species type, leaves properties, and growth logic (for add-ons to access, there are no palm trees in base DT).\nBug Fixes:\n- Fixed crash with Minecolonies.\n- Fixed harvest multiplier being ineffectual to log drops.\n- Fixed dynamic leaves dropping primitive leaves when broken without shears.\n- Fixed dynamic birch leaves colours not being changed by serene seasons.",
    "1.16.5-0.10.0-Beta14": "Bug Fixes:\n- Fixed density selectors - forests should now be as dense as they were in 1.12. \n- Fixed trees not spawning in modified wooded badlands.\n- Fixed loot tables support for certain blocks (temporary until drop creators are made). \n- Fixed not clearing model caches which caused a memory leak.",
    "1.16.5-0.10.0-Beta13": "Enhancements:\n- Added config option for whether or not the player can bone meal a tree.\nBug Fixes:\n- Fixed commands not being registered on server reload, meaning they would disappear. \n- Fixed trunk shell hardness bug. \n- Fixed trunk shell not disappearing on neighbour update.\n- Fixed potted dynamic sapling consuming items in creative mode. \n- Fixed bug where tree generation would be cancelled by grass or ferns. ",
    "1.16.5-0.10.0-Beta12": "Enhancements:\n- Updated lang files for spanish and french\nBug Fixes:\n- Fixed thick logs being transparent",
    "1.16.5-0.10.0-Beta11": "Enhancements:\n- Error logging and language improvements\n- Added bare cell kit for use in addons\n- Other minor improvements\nBug fixes:\n- Fixed season seed labels being incorrectly assigned\n- Prevented bee nests from filling forests over time\n- Other minor fixes",
    "1.16.5-0.10.0-Beta10": "Enhancements:\n- Internal changes to tree fall animation for extra add-on capabilities. \nBug Fixes:\n- Fixed vanilla tree cancellers.",
    "1.16.5-0.10.0-Beta9": "Enhancements:\n+ Create's tree fertiliser now gives the same effect as a burgeoning potion.\n- Updated Spanish translation [translated by Jorgegiral].\n- Updated Mexican Spanish translation [translated by EdicionGamerYT].\nBug Fixes:\n- Fixed apple trees not spawning in world gen (due to absent JoCodes). \n- Fixed two config options having the same ID, making configuration of seed drops rates inaccessible. \n- Fixed potted sapling not having a localisation.",
    "1.16.5-0.10.0-Beta8": "Enhancements:\n+ Added rooty terracotta. \n+ Rooty blocks can now use custom colour multipliers.\n+ Added localisations for staff tooltips. \n- Updated French translation [translated by @19PixelsPlaced]\n+ The trunk shell block can now be waterlogged. \nTree Packs:\n- Improvements to how tree packs are reloaded.\n+ The registry name of the generated leaves block can be changed in the leaves properties Json via block_registry_name. \n+ Additional \"valid\" leaves can now be added to the species Json via valid_leaves. \nBug Fixes:\n- Fixed an ArrayIndexOutOfBoundsException with the tree falling animation.\n- Fixed CraftTweaker incompatibility. \n- Fixed an issue where primitive logs and sticks couldn't be found from other mods.",
    "1.16.5-0.10.0-Beta7": "Enhancements:\n- Added Polish translation. [PR from SubcarpathianSkull]\n- Added soil life argument to /dt settree.\n- Improved nether worldgen\nBug Fixes:\n- Fixed trees being unbreakable in multiplayer servers\n- Fixed crashes related to ConcurrentModificationExcpetions.\n- Fixed dynamic tree configured feature not being registered properly.",
    "1.16.5-0.10.0-Beta6": "Initial 1.16.5 beta for CF."
  },
  "promos": {
    "1.16.5-latest": "1.16.5-0.10.0-Beta21",
    "1.16.5-recommended": "1.16.5-0.10.0-Beta21"
  }
}