{
	"homepage": "https://www.curseforge.com/minecraft/mc-mods/dynamictrees",
	"1.12.2": {
		"1.12.2-0.9.22": "New Features:\n- Added /dt transform for transforming tree species.\n- Added /dt createtransformpotion for spawning in transformation potions.\n- Added localisations for potion descriptions, season tooltips, and staff tooltips.\n- Added config options for disabling components of seasons compatibility.\nEnhancements:\n- Transformation potions recipes for add-ons trees are now auto-created.\n- Updated the Patchouli guide book with fixes and new pages.\n- Updated various localisation files. [PRs from Smollet777]\nBug Fixes:\n- Fixed incompatibility for Pyrotech’s extra stick drops.\n- Fixed Barretone bot crash. [PR from C0bra5]\n- Fixed tinker’s construct mattock not taking custom damage.\n- Fixed certain commands not working when targeting a thick branch.\n- Fixed Mekanism flamethrower crash.",
		"1.12.2-0.9.21": "New Features:\n- Make season manager position sensitive for more complex climate models(such as TFC)\nBug Fixes:\n- Fix species for location saplin transition problem(only affects certain add-ons)\n- Re-add deprecated function for compatibility with primitive mobs\n- Re-add deprecated addAcceptableSoil as an empty function for compatibility with underground biomes\n",
		"1.12.2-0.9.20": "New Features:\n- Greatly improve resistance to rare distorted tree models during worldgen\n- Enhanced rooty dirt mimic capabilities with new DirtHelper system\n- Admin commands to remove trees from chunks or clean up orphaned nodes\nBug Fixes:\n- Fix Tooltip crash\n- Fix nether generation density issues for add-on mods\nInternal:\n- Removed some deprecated methods\n",
		"1.12.2-0.9.19": "New Features:\n-Add support API functionality for Add-ons\n Bug Fixes:\n-Fixed stack overflow crash",
		"1.12.2-0.9.18": "New Features:\n- Created soil registry system.",
		"1.12.2-0.9.17": "New Features:\n- API support for new Dynamic Trees PHC Add-on feature.",
		"1.12.2-0.9.16": "New Features:\n- Add alternative snow layer block that forms on leaves(disabled by default) for the purpose of shader waving or custom models.\n- Add config option for giant mushrooms spawning in roofed forests (enabled by default).\n- Internal API additions for add-ons.\n\nBugs Fixed:\n- Transformations potions are not consumed if the target species already matches the potion species.\n- Add checks to prevent runaway mimic recursion causing a client side crash under rare circumstances.",
		"1.12.2-0.9.15": "New Features:\n- Added patchouli manual.\n- Added forge mod update checking.\n\nBugs Fixed:\n- Fixed concurrent modification exception crash during block breaking.\n- Fixed concurrent modification exception crash during multiple explosions.\n- Fixed \"perma-shrub\" bug that occured if doDayLightCycle was false.",
		"1.12.2-0.9.14": "New Features:\n- Removed \"Dynamic\" prefix from localized branch names.\n- Species name localizations (please be patient while add-ons catch up, species names will be unlocalized until new add-on releases are made with updated lang files).\n\nBugs Fixed:\n- Dimensions other than 0 now grow trees properly again (bug introduced by Serene Seasons integration effort).\n- Made rooty dirt blocks get color from mimic instead of grass (thanks Max Hyper).\n- Fix optifine shader interaction bug where sky could be seen through breaking texture on trees.\n- Fixed small crash with cactus model (thanks Max Hyper).\n\nInternal:\n- Enhanced SeasonHelper capabilities with helper functions.\n- Removed \"Wrapped\" classes and redefined blockstate files to be more standard.\n- Don't throw an exception when a JoCode file isn't defined."
	},
	"promos": {
		"1.12.2-latest": "1.12.2-0.9.22",
		"1.12.2-recommended": "1.12.2-0.9.22"
	}
}
